jwt_auth/src/InformationRegisters/JWTСессии/JWTСессии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>JWTСессии</name>
  <resources>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </resources>
  <resources>
    <name>ДействуетДо</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ХэшТокена</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отозван</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ИдентификаторТокена</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

jwt_auth/src/CommonModules/АдаптерРегистрJWTСессий/Module.bsl
Функция СессияПоИдентификатору(Знач ИдентификаторТокена, Знач РезолверПользователей) Экспорт
	Ответ = РегистрыСведений.JWTСессии.СессияПоИдентификатору(ИдентификаторТокена);
	
	Если Не ЗначениеЗаполнено(Ответ.ИдентификаторТокена) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Пользователь = РезолверПользователей.UUIDПоСсылке(Ответ.Пользователь);
	
	Сессия = Новый Структура;
	Сессия.Вставить("Отозван", Ответ.Отозван);
	Сессия.Вставить("ДействуетДо", Ответ.ДействуетДо);
	Сессия.Вставить("ХэшТокена", Ответ.ХэшТокена);
	Сессия.Вставить("Пользователь", Пользователь);
	Возврат Сессия;

КонецФункции

Процедура ЗаписатьСессию(Знач ИдентификаторТокена, Знач ИдентификаторПользователя, Знач ДействуетДоUTC, Знач ХэшТокена, Знач Отозван, Знач РезолверПользователей) Экспорт
	
	Пользователь = РезолверПользователей.СсылкаПоUUID(ИдентификаторПользователя);
	РегистрыСведений.JWTСессии.ЗаписатьСессию(ИдентификаторТокена, Пользователь, ДействуетДоUTC, ХэшТокена, Отозван);

КонецПроцедуры
